# Customer Retention

In [19]:
# Importing Libraries
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

## Dataset Overview

In [20]:
data = pd.read_excel('02 Churn-Dataset.xlsx')

In [21]:
data.columns

Index(['customerID', 'gender', 'SeniorCitizen', 'Partner', 'Dependents',
       'tenure', 'PhoneService', 'MultipleLines', 'InternetService',
       'OnlineSecurity', 'OnlineBackup', 'DeviceProtection', 'TechSupport',
       'StreamingTV', 'StreamingMovies', 'Contract', 'PaperlessBilling',
       'PaymentMethod', 'MonthlyCharges', 'TotalCharges', 'numAdminTickets',
       'numTechTickets', 'Churn'],
      dtype='object')

In [22]:
print('The number of rows in the dataset',data.index.value_counts().sum())

The number of rows in the dataset 7043

In [23]:
print('The Dataset overview : ')
data.info()

The Dataset overview :
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 23 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   customerID        7043 non-null   object
 1   gender            7043 non-null   object
 2   SeniorCitizen     7043 non-null   int64
 3   Partner           7043 non-null   object
 4   Dependents        7043 non-null   object
 5   tenure            7043 non-null   int64
 6   PhoneService      7043 non-null   object
 7   MultipleLines     7043 non-null   object
 8   InternetService   7043 non-null   object
 9   OnlineSecurity    7043 non-null   object
 10  OnlineBackup      7043 non-null   object
 11  DeviceProtection  7043 non-null   object
 12  TechSupport       7043 non-null   object
 13  StreamingTV       7043 non-null   object
 14  StreamingMovies   7043 non-null   object
 15  Contract          7043 non-null   object
 16  PaperlessBilling  7043 non-null   object
 17  PaymentMethod     7043 non-null   object
 18  MonthlyCharges    7043 non-null   float64
 19  TotalCharges      7043 non-null   object
 20  numAdminTickets   7043 non-null   int64
 21  numTechTickets    7043 non-null   int64
 22  Churn             7043 non-null   object
dtypes: float64(1), int64(4), object(18)
memory usage: 1.2+ MB

In [24]:
print('The data types for each column : ')
data.dtypes

The data types for each column :

customerID           object
gender               object
SeniorCitizen         int64
Partner              object
Dependents           object
tenure                int64
PhoneService         object
MultipleLines        object
InternetService      object
OnlineSecurity       object
OnlineBackup         object
DeviceProtection     object
TechSupport          object
StreamingTV          object
StreamingMovies      object
Contract             object
PaperlessBilling     object
PaymentMethod        object
MonthlyCharges      float64
TotalCharges         object
numAdminTickets       int64
numTechTickets        int64
Churn                object
dtype: object

In [25]:
data.head(5)

,customerID,gender,SeniorCitizen,Partner,Dependents,tenure,PhoneService,MultipleLines,InternetService,OnlineSecurity,...,StreamingTV,StreamingMovies,Contract,PaperlessBilling,PaymentMethod,MonthlyCharges,TotalCharges,numAdminTickets,numTechTickets,Churn
0,7590-VHVEG,Female,0,Yes,No,1,No,No phone service,DSL,No,...,No,No,Month-to-month,Yes,Electronic check,29.85,29.85,0,0,No
1,5575-GNVDE,Male,0,No,No,34,Yes,No,DSL,Yes,...,No,No,One year,No,Mailed check,56.95,1889.5,0,0,No
2,3668-QPYBK,Male,0,No,No,2,Yes,No,DSL,Yes,...,No,No,Month-to-month,Yes,Mailed check,53.85,108.15,0,0,Yes
3,7795-CFOCW,Male,0,No,No,45,No,No phone service,DSL,Yes,...,No,No,One year,No,Bank transfer (automatic),42.30,1840.75,0,3,No
4,9237-HQITU,Female,0,No,No,2,Yes,No,Fiber optic,No,...,No,No,Month-to-month,Yes,Electronic check,70.70,151.65,0,0,Yes

## Data Cleaning and Preprocessing

*Duplicate Values*

In [26]:
print("The number of duplicate rows in a dataset : ",data.duplicated().sum())

The number of duplicate rows in a dataset :  0

*Handling Null values*

In [27]:
data.isnull().sum()

customerID          0
gender              0
SeniorCitizen       0
Partner             0
Dependents          0
tenure              0
PhoneService        0
MultipleLines       0
InternetService     0
OnlineSecurity      0
OnlineBackup        0
DeviceProtection    0
TechSupport         0
StreamingTV         0
StreamingMovies     0
Contract            0
PaperlessBilling    0
PaymentMethod       0
MonthlyCharges      0
TotalCharges        0
numAdminTickets     0
numTechTickets      0
Churn               0
dtype: int64

*Data Type Conversion*

In [28]:
data['MonthlyCharges'] = data['MonthlyCharges'].round(0).astype(int)

In [29]:
data['TotalCharges'].dtype

dtype('O')

In [30]:
data['TotalCharges'] = pd.to_numeric(data['TotalCharges'], errors='coerce')
data['TotalCharges'].dtype

dtype('float64')

In [31]:
data['TotalCharges'] = data['TotalCharges'].round(0)
data['TotalCharges'] = data['TotalCharges'].fillna(value = data['TotalCharges'].mean())
data['TotalCharges'].isnull().sum()

np.int64(0)

In [32]:
data['TotalCharges'] = data['TotalCharges'].round(0).astype(int)
data[['TotalCharges','MonthlyCharges']].head(5)

   TotalCharges  MonthlyCharges
0            30              30
1          1890              57
2           108              54
3          1841              42
4           152              71

*Standardizing Formats*

In [33]:
data['SeniorCitizen'] = data['SeniorCitizen'].replace({1:'Yes',0:'No'})
data['SeniorCitizen'].unique()

array(['No', 'Yes'], dtype=object)

## Data Aggrgation

In [42]:
data['customerID'].count()

np.int64(7043)

In [38]:
data.groupby('gender')[['SeniorCitizen','Partner','Dependents']].count()

        SeniorCitizen  Partner  Dependents
gender
Female           3488     3488        3488
Male             3555     3555        3555

In [53]:
contract_charges = data.groupby('gender')['tenure'].agg(['mean','median','count'])
contract_charges.round(2)

         mean  median  count
gender
Female  32.24    29.0   3488
Male    32.50    29.0   3555

In [52]:
contract_charges = data.groupby('Contract')[['MonthlyCharges','TotalCharges']].agg(['mean','sum'])
contract_charges.round(2)

               MonthlyCharges         TotalCharges
                         mean     sum         mean      sum
Contract
Month-to-month          66.39  257270      1369.25  5305843
One year                65.05   95812      3034.18  4469345
Two year                60.78  103014      3720.39  6306053

In [54]:
data[data['Churn']=='Yes']['PaymentMethod'].value_counts()

PaymentMethod
Electronic check             1071
Mailed check                  308
Bank transfer (automatic)     258
Credit card (automatic)       232
Name: count, dtype: int64

In [57]:
contract_churn = data.pivot_table(values = 'MonthlyCharges', index = 'Contract', columns = 'Churn', aggfunc=['mean'])
contract_churn.round(2)

                 mean
Churn              No    Yes
Contract
Month-to-month  61.46  73.00
One year        62.50  85.06
Two year        60.02  86.75

In [62]:
contract_churn = data.pivot_table(values="TotalCharges", index="InternetService", columns="Churn", aggfunc=["mean","sum"])
contract_churn.round(2)

                    mean               sum
Churn                 No      Yes       No      Yes
InternetService
DSL              2432.60   784.34  4772770   360011
Fiber optic      4135.83  1914.62  7440360  2483265
No                711.38   173.90  1005184    19651